{
    "_class_name": "DEISMultistepScheduler",
    "num_train_timesteps": 1000,
    "beta_start": 0.00085,
    "beta_end": 0.012,
    "beta_schedule": "scaled_linear",
    "trained_betas": null,
    "solver_order": 2,
    "prediction_type": "epsilon",
    "thresholding": false,
    "dynamic_thresholding_ratio": 0.995,
    "sample_max_value": 1.0,
    "algorithm_type": "deis",
    "solver_type": "logrho",
    "lower_order_final": true,
    "use_karras_sigmas": false,
    "timestep_spacing": "leading",
    "steps_offset": 1,
    "_diffusers_version": "0.22.0.dev0",
    "clip_sample": false,
    "set_alpha_to_one": false
  }